In [1]:
import pandas as pd

### Basic Merge (NaN present)

In [2]:
df1 = pd.DataFrame({'A': ['A1', 'A1', 'A2', 'A3'],
                     'B': ['121', '345', '123', '146'],
                     'C': ['K0', 'K1', 'K0', 'K1']})

In [3]:
df1

    A    B   C
0  A1  121  K0
1  A1  345  K1
2  A2  123  K0
3  A3  146  K1

In [4]:
df2 = pd.DataFrame({'A': ['A1', 'A3'],
                      'BB': ['B0', 'B3'],
                      'CC': ['121', '345'],
                      'DD': ['D0', 'D1']})

In [5]:
df2

    A  BB   CC  DD
0  A1  B0  121  D0
1  A3  B3  345  D1

In [6]:
Both_DFs=pd.merge(df1, df2, how='left',left_on=['A'], right_on=['A'])

In [7]:
Both_DFs

    A    B   C   BB   CC   DD
0  A1  121  K0   B0  121   D0
1  A1  345  K1   B0  121   D0
2  A2  123  K0  NaN  NaN  NaN
3  A3  146  K1   B3  345   D1

### Inner and Outer Merges

In [8]:
inner = pd.merge(df1, df2, how='inner')  #equivalent to pd.merge(df1, df2,left_on=['A'], right_on=['A'])
inner

    A    B   C  BB   CC  DD
0  A1  121  K0  B0  121  D0
1  A1  345  K1  B0  121  D0
2  A3  146  K1  B3  345  D1

In [9]:
outer = pd.merge(df1, df2, how='outer') #equivalent to pd.merge(df1, df2, how='left',left_on=['A'], right_on=['A'])
outer

    A    B   C   BB   CC   DD
0  A1  121  K0   B0  121   D0
1  A1  345  K1   B0  121   D0
2  A2  123  K0  NaN  NaN  NaN
3  A3  146  K1   B3  345   D1

### Merging dataframes with 2 similar columns

In [10]:
df3 = pd.DataFrame({'Day': ['1', '2', '1'],
                     'Borough': ['A', 'A', 'A']})

In [11]:
df3

  Day Borough
0   1       A
1   2       A
2   1       A

In [12]:
df4 = pd.DataFrame({'Day': ['1', '1', '3', '4'],
                     'Borough': ['A', 'C', 'D', 'E'],
                     'Covid Cases': ['20', '30', '50', '80']})

In [13]:
df4

  Day Borough Covid Cases
0   1       A          20
1   1       C          30
2   3       D          50
3   4       E          80

In [15]:
inner1 = pd.merge(df3, df4, how='inner')
inner1

  Day Borough Covid Cases
0   1       A          20
1   1       A          20

In [16]:
outer1 = pd.merge(df3, df4, how='outer')
outer1

  Day Borough Covid Cases
0   1       A          20
1   1       A          20
2   2       A         NaN
3   1       C          30
4   3       D          50
5   4       E          80

### Groupby Outputs

In [ ]:
df3 = pd.DataFrame({'Day': ['1', '2', '1', '2'],
                     'Borough': [300, 400, 20,10 ]})

In [ ]:
df3

In [ ]:
grouped_df3 = df3.groupby('Day')['Borough'].size()

In [ ]:
grouped_df3

In [ ]:
grouped_df3 = df3.groupby('Day')['Borough'].sum()

In [ ]:
grouped_df3

In [ ]:
grouped_df3 = df3.groupby('Day')['Borough'].count()   #should be similar to size()

In [ ]:
grouped_df3